{"podcast_details": {"podcast_title": "Marketing School - Digital Marketing and Online Marketing Tips", "episode_title": "Threads loses half of its 100M users #2542", "episode_image": "https://megaphone.imgix.net/podcasts/6d545d6a-9394-11ed-bcac-0f9c9d036025/image/marketingschoolcoverart.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " All right. So threads just lost half of its early users. So I think the number was they got up to a hundred million or so, and they're saying that maybe only 50 million or so are sticking around. That's kind of the headline number that I'm seeing. Have you heard something similar? I haven't seen any data on how many thread users are sticking around, but I know a lot of people have stopped using threads that were super engaged in the first week. Yep. So I think, I mean, what do you think are some of the lessons here? You can go first and I'll go. We got a special message from our sponsor. If you want to rank higher on Google, you got to look at your page speed time. The faster your website loads, the better off you are with Google's core vital update. That makes it super, super important to optimize your site for load time. And one easy way to do it is use the host that Eric and I use dream hosts. So just go to dream host or Google it, find it, check it out. And it's a great way to improve your load time. Just because something is hot and everyone's talking about it doesn't mean it's going to permanently stay that way. Another thing too is in marketing, what people don't really comprehend is when you're used to something and consumers are used to something, it's hard to change your perception. So for example, people are used to going on Twitter to post similar types of messages that they would post on threads. It's hard to just get them to switch and just be like all of a sudden, hey, you no longer need to post on Twitter or you can do both. We tend to get stuck in our ways. And another great example of this is Google. There's been a lot of studies that show that being search results are more relevant than Google, but as consumers, we're used to just going to Google and searching and we're happy with it. Is being better or not? Well, that's debatable, but people are satisfied with what they're getting at Google so they don't really care to switch. So here's how I look at it too. When I think about email marketing, your objective as an email marketer is really, sure, it's to convert, but ultimately you want to retain, which means you want them to look forward to the next email, which means you need to write a good email address or not a good email address, a good email newsletter. And so when I think about threads, what I liked about it initially was that it was very bare bones, which was the plus, but the minus also is that it's very bare bones. And so then it's like, what is the incentive to come back when maybe a lot of the people that are established on Twitter are already getting great engagement so that the natural writers are already there? And then the people that were testing out threads, it was like the new and novel thing, but at the end of the day, you can see it really started to fizzle out for the people that are not natively used to writing. And so people are used to what they're used to and people also, it's hard to change behaviors as well, right? And so do I think threads will fail? No, I think it's still very much an and type of equation. So it's threads and it's not even Twitter anymore. It's threads and X, right? And so I would just say that. And then the other thing is you can't count meta out because they had a small strike team that was kind of working on this. They're going to put more resources towards this. 50 million is still a significant number. It might decline a little more, but I do believe that they're going to improve the product and they're going to collect user feedback. They're going to look at what's good and they're just going to improve the product over time. And you've seen, they've been pretty good at copying over the years, right? Whether it's adding stories, whether it's adding reels and now in this case adding threads, right? So I wouldn't count them out. I mean, I think they still have one of the best teams in the world. So that's all it is at the end of the day. So it's not a knockout punch for threads, but this is also a lesson for you in terms of if you're going to build something, just keep in mind, just because you get a lot of people in the beginning, you also have to be able to retain the users as well. And that means a lot of customer development. That means a lot of looking at the data to see what works and what doesn't and constantly iterating. Yeah, and what you should do if you're trying to get the most out of as a marketer, don't worry if people are using threads or not. Use all platforms. You can use similar messages to what you use on Twitter on threads. Just post in multiple places. Doesn't take that much more time. If you get extra play, great. If not, no worries. Something extra is better than nothing. So the other thing I'll say is I still like posting the threads to test concepts because I, maybe it's a psychological thing. It is a psychological thing for me, but I don't feel as much judgment when I post the threads. And so I'm just going to go post the threads first, see how it does. And then that's where I might consider posting to other channels. So you might look at it that way as well. That might be a little psychological hack for you, but I find that I tend to not be as filtered, which can be a good or bad thing when I'm posting the thread. So just keep that part in mind. But again, I mean, we're still in the very early innings right now. I would say we're not even through the first inning right now for threads. So just be patient with it. A lot of people like to use these headline numbers and it is what it is. Cool. Well, that's it for today's episode. Make sure you rate review this podcast. We love those five star ratings and reviews. Again, really appreciate it. We look forward to seeing you tomorrow."}, "podcast_summary": "Threads, a new social media platform, has lost half of its early users, dropping from 100 million to 50 million. This decline highlights two important marketing lessons. First, just because something is popular at first doesn't mean it will stay that way. People are often resistant to change and may stick to what they're familiar with, like Twitter. Second, to build a successful product, customer retention is crucial. This requires continuous customer development, analyzing data, and iterating on the product. As a marketer, it's important to not solely rely on one platform. Use all available platforms and adjust your messaging accordingly. Additionally, consider posting on threads first for a more judgment-free environment before deciding to post elsewhere. Though threads may still have potential, patience is required as it's still in the early stages.", "podcast_highlights": "In this podcast, the hosts discuss the decline in users on the platform Threads. While the exact numbers are not known, it is clear that many users have stopped using Threads after initially being engaged. The hosts discuss the lessons to be learned from this, highlighting the fact that just because something is popular initially, it doesn't mean it will stay that way. They also talk about the difficulty in getting users to switch from a platform they are familiar with, like Twitter, and the importance of user retention. Despite the decline in users, the hosts believe that Threads can still succeed as part of an integrated strategy with other platforms like Twitter. They also emphasize the need for constant iteration and customer development when building a product. As a marketer, they suggest using multiple platforms and not worrying too much about whether or not users are using Threads specifically, as posting on multiple platforms can increase exposure. The hosts also mention the psychological benefit of posting on Threads first, as it can feel less judgmental and allow for more unfiltered content. Overall, they advise patience and caution against solely relying on headline numbers to assess the success of a platform."}